Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/edc/PIC32MZ1024EFM100.PIC
      <edc:SFRDef edc:_addr="0x1F801490" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="33" edc:access="----------------------------nnnn" edc:cname="U6RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U6RXR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6RXR" edc:desc="" edc:mask="0xf" edc:name="U6RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801494" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="34" edc:access="----------------------------nnnn" edc:cname="U6CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U6CTSR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U6CTSR" edc:desc="" edc:mask="0xf" edc:name="U6CTSR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801498" edc:offset="04"/>
      <edc:SFRDef edc:_addr="0x1F80149C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="35" edc:access="----------------------------nnnn" edc:cname="SDI1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0xf" edc:name="SDI1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8014A0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="36" edc:access="----------------------------nnnn" edc:cname="SS1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0xf" edc:name="SS1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8014A4" edc:offset="04"/>
      <edc:SFRDef edc:_addr="0x1F8014A8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="37" edc:access="----------------------------nnnn" edc:cname="SDI2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI2R" edc:desc="" edc:mask="0xf" edc:name="SDI2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8014AC" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="38" edc:access="----------------------------nnnn" edc:cname="SS2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS2R" edc:desc="" edc:mask="0xf" edc:name="SS2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8014B0" edc:offset="04"/>
      <edc:SFRDef edc:_addr="0x1F8014B4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="39" edc:access="----------------------------nnnn" edc:cname="SDI3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI3R" edc:desc="" edc:mask="0xf" edc:name="SDI3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8014B8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="40" edc:access="----------------------------nnnn" edc:cname="SS3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS3R" edc:desc="" edc:mask="0xf" edc:name="SS3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8014BC" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8014C0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="41" edc:access="----------------------------nnnn" edc:cname="SDI4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI4R" edc:desc="" edc:mask="0xf" edc:name="SDI4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
